evaluators/promise-traceability/evaluator.yaml
# Deterministic layer only. No model, no network, reproducible from the candidate bytes.
# The digests below must equal the output of: bun run evaluators/shared/identity.ts <this directory>
schema_version: "1"
evaluator:
  id: promise-traceability
  version: "1"
  revision: source-tree
  target_profile: artemis-java-maven
  implementation_digest: a5863b9c3f59f017a4e54d1e753fd5e1073cae3b8dd957a3ec440c352e193163
suite:
  id: promise-traceability-study
  version: "1"
  digest: d66454acb52f8927c53ba9eaa6fb4e04fe1ecb00647c64c81d8240933f0c96a6
requested_metrics:
  - promise.witnessed_ratio
  - promise.unwitnessed_claims
  - promise.unclassified_normative_units
  - api.member_reference_ratio
  - exception.assertthrows_ratio
  - boundary.literal_ratio
  - tests.behavioural_methods
  - tests.assertions
  - tests.assertion_density
  - tests.assertionless_methods
  - tests.structural_lane_present
process:
  argv: ["{bun}", "run", "worker.ts"]
  cwd: "."
  env: {}
execution:
  timeout_ms: 60000
  concurrency: 4
  maximum_input_bytes: 1048576
  maximum_response_bytes: 16777216
  maximum_log_bytes: 1048576
  termination_grace_ms: 2000